#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/fe17d314-2451-4b66-ad64-120ea98535b9/resourceGroups/eastus-fourlanches-rg]
azurerm_storage_account.main_sa: Refreshing state... [id=/subscriptions/fe17d314-2451-4b66-ad64-120ea98535b9/resourceGroups/eastus-fourlanches-rg/providers/Microsoft.Storage/storageAccounts/eastusfourlanchessa]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_storage_account.main_sa will be updated in-place
  ~ resource "azurerm_storage_account" "main_sa" {
      ~ allow_nested_items_to_be_public   = false -> true
        id                                = "/subscriptions/fe17d314-2451-4b66-ad64-120ea98535b9/resourceGroups/eastus-fourlanches-rg/providers/Microsoft.Storage/storageAccounts/eastusfourlanchessa"
      ~ min_tls_version                   = "TLS1_0" -> "TLS1_2"
        name                              = "eastusfourlanchessa"
        tags                              = {}
        # (31 unchanged attributes hidden)

      - timeouts {}

        # (4 unchanged blocks hidden)
    }

  # module.dbs.azurerm_postgresql_database.main_db will be created
  + resource "azurerm_postgresql_database" "main_db" {
      + charset             = "UTF8"
      + collation           = "pt_BR.utf8"
      + id                  = (known after apply)
      + name                = "fourlanchesdb"
      + resource_group_name = "eastus-fourlanches-rg"
      + server_name         = "fourlanches-psqlserver"
    }

  # module.dbs.azurerm_postgresql_server.main_psqlserver will be created
  + resource "azurerm_postgresql_server" "main_psqlserver" {
      + administrator_login              = "fourlanchesapp"
      + administrator_login_password     = (sensitive value)
      + auto_grow_enabled                = true
      + backup_retention_days            = (known after apply)
      + create_mode                      = "Default"
      + fqdn                             = (known after apply)
      + geo_redundant_backup_enabled     = false
      + id                               = (known after apply)
      + location                         = "eastus"
      + name                             = "fourlanches-psqlserver"
      + public_network_access_enabled    = true
      + resource_group_name              = "eastus-fourlanches-rg"
      + sku_name                         = "B_Gen4_1"
      + ssl_enforcement_enabled          = true
      + ssl_minimal_tls_version_enforced = "TLS1_2"
      + storage_mb                       = (known after apply)
      + version                          = "11"
    }

  # module.functions.azurerm_linux_function_app.auth_function will be created
  + resource "azurerm_linux_function_app" "auth_function" {
      + builtin_logging_enabled           = true
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Optional"
      + content_share_force_disabled      = false
      + custom_domain_verification_id     = (sensitive value)
      + daily_memory_time_quota           = 0
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + functions_extension_version       = "~4"
      + https_only                        = false
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "eastus"
      + name                              = "eastus-fourlanches-auth-function"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "eastus-fourlanches-rg"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (known after apply)
      + storage_account_access_key        = (sensitive value)
      + storage_account_name              = "eastusfourlanchessa"
      + storage_uses_managed_identity     = false

      + site_config {
          + always_on                               = (known after apply)
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + ip_restriction                          = (known after apply)
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction                      = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)
        }
    }

  # module.functions.azurerm_service_plan.main_app_service will be created
  + resource "azurerm_service_plan" "main_app_service" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "eastus"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "eastus-fourlanches-app-service"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "eastus-fourlanches-rg"
      + sku_name                     = "Y1"
      + worker_count                 = (known after apply)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @felipemag, Action: `pull_request`*